#+TITLE: DOOM GNU Emacs Config
#+AUTHOR: Bastian Henneberg
#+DESCRIPTION: My personal Emacs configuration.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* DOOM Emacs Config
#+begin_src emacs-lisp
;; (setq doom-theme 'doom-dracula)
(setq doom-theme 'catppuccin)
(setq catppuccin-flavor 'macchiato) ;; or 'latte, 'macchiato, or 'mocha


(setq display-line-numbers-type 'relative)

;; Line Spacing for Emacs
(setq-default line-spacing 0.12)

;; Settings for Font Family and Size
;;(setq doom-font (font-spec :family "MesloLGL Nerd Font Mono" :size 16))
(setq doom-font (font-spec :family "Victor Mono Medium" :size 17))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

#+end_src

#+RESULTS:
| doom--customize-themes-h-35 | doom--customize-themes-h-603 |

